src/test/java/stefanholzmueller/soapclient/soap/CopyIntoItems.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><CopyIntoItems xmlns="http://schemas.microsoft.com/sharepoint/soap/"><SourceUrl>&amp;</SourceUrl><DestinationUrls><string>myDestinationUrl1</string><string>myDestinationUrl2</string></DestinationUrls><Fields><FieldInformation Type="Number" DisplayName="field1displayName" InternalName="field1internalName" Value="field1value"/></Fields><Stream>dGVzdCDDpMO2w7zDnyAmPA==</Stream></CopyIntoItems></soapenv:Body></soapenv:Envelope>